# StructuralConnectionWrongType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralConnectionWrongType Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
Structural Connection has an inappropriate type assigned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralConnectionWrongType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionWrongType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralConnectionWrongType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace